---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToTee
source: html/400cfa09-d1b6-85dd-e0c7-f75d38ae0bc6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToTee Property

Failed to downgrade cross type to tee type.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedDowngradeCrossToTee { get; }
```